# 로또 프로그램, 숫자 맞추기 프로그램, 성적 처리 프로그램 외워두면 좋음~~ #


## 로또 프로그램
import random
# 6개 숫자 랜덤 번호 생성
# 6개 입력한 번호 생성
# 당첨번호 확인
# 출력



## 숫자 맞추기 프로그램
import random
# 1차원 리스트 1-25까지 숫자 생성
# 랜덤으로 섞기
# 2차원 리스트에 1차원 리스트 값 넣기
# 번호 입력
# 입력된 번호에 맞는 위치 - X 표시



## 성적 처리 프로그램
# 데이터 생성 - 리스트 타입의 딕셔너리 데이터 생성 [{:}, {:}, {:}]
# 출력 화면
# 1. 학생 성적 입력
#   - 학생 번호 자동 생성
#   - 학생 성적 입력을 무한 반복 실행 (while True:)
#   - 이전 화면 이동 구현
#   - 점수 입력에 대한 체크 : 숫자인지 확인, 0-100 사이 점수인지 확인
# 2. 학생 성적 출력
#   - 상단 타이틀 출력 (제목 부분)
#   - 각 학생별 성적 출력
# 3. 학생 성적 수정
#   - 수정하고자 하는 학생 검색
#   - 수정하려는 과목 선택
#   - 검색이 되지 않았을 경우 구현 (if temp==0:)
# 4. 학생 성적 정렬
#   - 이름으로 순차 정렬
#   - 합계로 순차 정렬
# 5. 학생 성적 검색
#   - 찾고자 하는 학생 검색 후 있으면 화면 출력
# 6. 등수 처리
#   - 합계를 기준으로 등수처리 진행
# 0. 종료